## Staging: database-tools
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |               NAME               |
|----------|----------------------------------|
| update   | `aws_ecs_service.blazer`         |
| recreate | `aws_ecs_task_definition.blazer` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.blazer will be updated in-place
  ~ resource "aws_ecs_service" "blazer" {
        id                                 = "arn:aws:ecs:ca-central-1:239043911459:service/blazer/blazer"
        name                               = "blazer"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:239043911459:task-definition/blazer:15" -> (known after apply)
        # (15 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.blazer must be replaced
-/+ resource "aws_ecs_task_definition" "blazer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:239043911459:task-definition/blazer:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:239043911459:task-definition/blazer" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "blazer" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_db_instance.database-tools,
  on rds.tf line 18, in resource "aws_db_instance" "database-tools":
  18:   name                = "database_tools"

Use db_name instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.database-tools"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.database-tools-rds-subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_exection_role_parameter_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_task_role_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.db_tools_environment_variables"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.sqlalchemy_database_reader_uri"]

32 tests, 17 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
